Revit 2027 API
BuiltInFailures.SteelElementsFailures Class
 Failures about SteelElement module
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SteelElementsFailures
Public NotInheritable Class SteelElementsFailures
public ref class SteelElementsFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SteelElementsFailures = class end
The BuiltInFailures.SteelElementsFailures type exposes the following members.
Properties
Name | Description
SteelElementInvisibleInCurrentLevelOfDetailWarn |  The created elements are only visible in Detail Level: Fine.
SteelElementModifiersWillBeIgnoredWarn |  The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.
Top
See Also
Reference
Autodesk.Revit.DB Namespace